improve setup docs
